{
  "company": "A Place for Mom",
  "role": "Senior Director, Engineering - Senior Living",
  "location": "",
  "compensation": "$100",
  "applied_date": null,
  "source": "Linkedin",
  "source_url": "https://www.aplaceformom.com/senior-living",
  "status": "pending_review",
  "follow_up_date": null,
  "contact": "",
  "resume_version": null,
  "cover_letter": null,
  "former_employer": false,
  "former_employer_role": null,
  "notes": "Sourced via email pipeline on 2026-02-27. Email subject: Fw: “chief technology officer”: X4 Life Sciences - Chief Product & Technology Of",
  "match_score": {
    "overall": "long_shot",
    "requirements_matched": [],
    "requirements_partial": [
      "Your Complete Guide to Memory Care",
      "Your Complete Guide to Home Care",
      "Take our free care quiz",
      "Increased safety for older adults:",
      "Socialization opportunities for seniors:",
      "Wellness support tailored to seniors:",
      "Personal care planning and care coordination services may be available.",
      "Signs it's time for senior living",
      "Senior living costs and payment options",
      "Residential care homes"
    ],
    "gaps": [
      "The senior meets community age requirements and doesn’t need any care services.",
      "Home care and assisted living communities:",
      "The senior needs help with a couple of activities of daily living (ADLs), such as bathing and eating, but is otherwise independent.",
      "The senior has symptoms of Alzheimer’s disease or another type of dementia, and they need help with ADLs.",
      "The senior needs skilled medical care for short-term or long-term conditions.",
      "What are the types of senior living?",
      "Senior living options range from senior apartments and other 55+ communities to nursing homes. The biggest difference between each option is the level of care they provide to residents.",
      "For independent seniors who don’t need assistance, senior apartments or independent living may be the right fit. Active seniors who need help with",
      "activities of daily living",
      "Your Complete Guide to Assisted Living",
      "Assisted living provides long-term housing and care for generally active seniors who need assistance with activities of daily...",
      "Read the full article",
      "Memory care provides long-term housing and specialized care for seniors with dementia or memory loss.",
      "Read the full article",
      "Your Complete Guide to Senior Apartments",
      "Understand the amenities and costs associated with senior apartments, with tips on how to know if it's the right fit.",
      "Read the full article",
      "Your Complete Guide to Nursing Homes",
      "Learn everything you need to know about nursing homes, include costs, services, amenities, and payment options.",
      "Read the full article",
      "Senior home care services can include help with ADLs, housekeeping, and skilled nursing services, and costs are usually based...",
      "Read the full article",
      "Let our care assessment guide you",
      "Our free tool provides options, advice, and next steps based on your unique situation.",
      "What are the benefits of senior living?",
      "Features such as secured campuses and environments specifically tailored to prevent falls can provide peace of mind.",
      "Holiday celebrations, educational classes, and more keep seniors engaged with their peers.",
      "Healthy meals designed to support aging adults:",
      "Chefs and nutritionists may accommodate seniors’ unique dietary needs.",
      "Low-stress lifestyles:",
      "Senior living staff may handle maintenance, laundry, housekeeping, and transportation services.",
      "10 Surprising Facts About Senior Living",
      "Read the full article",
      "Health & Wellness",
      "Senior Living and Socialization: How Social Engagement in Communities Benefits Health",
      "Read the full article",
      "10 Signs Your Elderly Parent Needs Help",
      "Read the full article",
      "3 Appearance-Related Warning Signs Your Parent Is Unable to Live Alone",
      "Changes in appearance can show signs of dementia, depression, and other signs a parent may need help.",
      "Read the full article",
      "5 Steps to Take When You Can No Longer Take Care of an Elderly Parent",
      "Learn how to talk with your family about the need for a new caregiving arrangement.",
      "Read the full article",
      "When to Move to Senior Living: Weighing Your Loved One’s Wants and Needs",
      "Observe your loved one to understand whether or not they need help. Signs include sudden weight loss, expired food, and ...",
      "Read the full article",
      "A Place for Mom’s 2024 Cost of Long-Term Care and Senior Living Report",
      "Independent living",
      "Senior apartments",
      "The monthly median cost of assisted living in the U.S. is $5,1"
    ],
    "addressable_gaps": [],
    "hard_gaps": [],
    "keywords": []
  },
  "tailoring_intensity": null,
  "interview_date": null,
  "interview_round": null,
  "interview_type": null,
  "interview_notes_file": null,
  "rejection_date": null,
  "rejection_reason": null,
  "rejection_insights": null,
  "offer": {
    "salary": null,
    "equity": null,
    "signing_bonus": null,
    "remote": "unknown",
    "benefits_notes": null,
    "decision_deadline": null
  },
  "offer_accepted": null,
  "learning_flags": [],
  "email_uid": "13",
  "pipeline_batch": "2026-02-27_82085d",
  "pipeline_confidence": 0.85,
  "employment_type": "full_time",
  "skip_date": null,
  "skip_reason": null
}